The Layout Pattern cannot accommodate the current data. Try decreasing the Number of Wires/Spacing.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId WrongFabricSheetLayoutPattern { get; }
  Visual Basic
Public Shared ReadOnly Property WrongFabricSheetLayoutPattern As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ WrongFabricSheetLayoutPattern {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FabricFailures Class
  Autodesk.Revit.DB Namespace